Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
3 STDOUT terraform1.11.0:                         type: object
17:12:25.413 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.413 STDOUT terraform1.11.0:                       status:
17:12:25.413 STDOUT terraform1.11.0:                         description: Status defines the observed state of KuberoMysql
17:12:25.413 STDOUT terraform1.11.0:                         type: object
17:12:25.413 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.413 STDOUT terraform1.11.0:                     type: object
17:12:25.413 STDOUT terraform1.11.0:                 served: true
17:12:25.413 STDOUT terraform1.11.0:                 storage: true
17:12:25.413 STDOUT terraform1.11.0:                 subresources:
17:12:25.413 STDOUT terraform1.11.0:                   status: {}
17:12:25.413 STDOUT terraform1.11.0:         EOT
17:12:25.413 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.413 STDOUT terraform1.11.0:     }
17:12:25.413 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[16] will be created
17:12:25.413 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.413 STDOUT terraform1.11.0:       + api_version             = "apiextensions.k8s.io/v1"
17:12:25.413 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.413 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.413 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.413 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.413 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.413 STDOUT terraform1.11.0:       + kind                    = "CustomResourceDefinition"
17:12:25.413 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.413 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.413 STDOUT terraform1.11.0:       + name                    = "kuberopipelines.application.kubero.dev"
17:12:25.414 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.414 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.414 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.414 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.414 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.414 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.414 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.414 STDOUT terraform1.11.0:             apiVersion: apiextensions.k8s.io/v1
17:12:25.414 STDOUT terraform1.11.0:             kind: CustomResourceDefinition
17:12:25.414 STDOUT terraform1.11.0:             metadata:
17:12:25.414 STDOUT terraform1.11.0:               name: kuberopipelines.application.kubero.dev
17:12:25.414 STDOUT terraform1.11.0:             spec:
17:12:25.414 STDOUT terraform1.11.0:               group: application.kubero.dev
17:12:25.414 STDOUT terraform1.11.0:               names:
17:12:25.414 STDOUT terraform1.11.0:                 kind: KuberoPipeline
17:12:25.414 STDOUT terraform1.11.0:                 listKind: KuberoPipelineList
17:12:25.414 STDOUT terraform1.11.0:                 plural: kuberopipelines
17:12:25.414 STDOUT terraform1.11.0:                 singular: kuberopipeline
17:12:25.414 STDOUT terraform1.11.0:               scope: Namespaced
17:12:25.414 STDOUT terraform1.11.0:               versions:
17:12:25.414 STDOUT terraform1.11.0:               - name: v1alpha1
17:12:25.414 STDOUT terraform1.11.0:                 schema:
17:12:25.414 STDOUT terraform1.11.0:                   openAPIV3Schema:
17:12:25.414 STDOUT terraform1.11.0:                     description: KuberoPipeline is the Schema for the kuberopipelines API
17:12:25.414 STDOUT terraform1.11.0:                     properties:
17:12:25.414 STDOUT terraform1.11.0:                       apiVersion:
17:12:25.414 STDOUT terraform1.11.0:                         description: 'APIVersion defines the versioned schema of this representation
17:12:25.414 STDOUT terraform1.11.0:                           of an object. Servers should convert recognized schemas to the latest
17:12:25.414 STDOUT terraform1.11.0:                           internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
17:12:25.414 STDOUT terraform1.11.0:                         type: string
17:12:25.414 STDOUT terraform1.11.0:                       kind:
17:12:25.414 STDOUT terraform1.11.0:                         description: 'Kind is a string value representing the REST resource this
17:12:25.414 STDOUT terraform1.11.0:                           object represents. Servers may infer this from the endpoint the client
17:12:25.414 STDOUT terraform1.11.0:                           submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
17:12:25.415 STDOUT terraform1.11.0:                         type: string
17:12:25.415 STDOUT terraform1.11.0:                       metadata:
17:12:25.415 STDOUT terraform1.11.0:                         type: object
17:12:25.415 STDOUT terraform1.11.0:                       spec:
17:12:25.415 STDOUT terraform1.11.0:                         description: Spec defines the desired state of KuberoPipeline
17:12:25.415 STDOUT terraform1.11.0:                         type: object
17:12:25.415 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.415 STDOUT terraform1.11.0:                       status:
17:12:25.415 STDOUT terraform1.11.0:                         description: Status defines the observed state of KuberoPipeline
17:12:25.415 STDOUT terraform1.11.0:                         type: object
17:12:25.415 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.415 STDOUT terraform1.11.0:                     type: object
17:12:25.415 STDOUT terraform1.11.0:                 served: true
17:12:25.415 STDOUT terraform1.11.0:                 storage: true
17:12:25.415 STDOUT terraform1.11.0:                 subresources:
17:12:25.415 STDOUT terraform1.11.0:                   status: {}
17:12:25.415 STDOUT terraform1.11.0:         EOT
17:12:25.415 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.415 STDOUT terraform1.11.0:     }
17:12:25.415 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[17] will be created
17:12:25.415 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.415 STDOUT terraform1.11.0:       + api_version             = "apiextensions.k8s.io/v1"
17:12:25.415 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.415 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.415 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.415 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.415 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.415 STDOUT terraform1.11.0:       + kind                    = "CustomResourceDefinition"
17:12:25.415 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.415 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.415 STDOUT terraform1.11.0:       + name                    = "kuberopostgresqls.application.kubero.dev"
17:12:25.415 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.415 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.415 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.416 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.416 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.416 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.416 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.416 STDOUT terraform1.11.0:             apiVersion: apiextensions.k8s.io/v1
17:12:25.416 STDOUT terraform1.11.0:             kind: CustomResourceDefinition
17:12:25.416 STDOUT terraform1.11.0:             metadata:
17:12:25.416 STDOUT terraform1.11.0:               name: kuberopostgresqls.application.kubero.dev
17:12:25.416 STDOUT terraform1.11.0:             spec:
17:12:25.416 STDOUT terraform1.11.0:               group: application.kubero.dev
17:12:25.416 STDOUT terraform1.11.0:               names:
17:12:25.416 STDOUT terraform1.11.0:                 kind: KuberoPostgresql
17:12:25.416 STDOUT terraform1.11.0:                 listKind: KuberoPostgresqlList
17:12:25.416 STDOUT terraform1.11.0:                 plural: kuberopostgresqls
17:12:25.416 STDOUT terraform1.11.0:                 singular: kuberopostgresql
17:12:25.416 STDOUT terraform1.11.0:               scope: Namespaced
17:12:25.416 STDOUT terraform1.11.0:               versions:
17:12:25.416 STDOUT terraform1.11.0:               - name: v1alpha1
17:12:25.416 STDOUT terraform1.11.0:                 schema:
17:12:25.416 STDOUT terraform1.11.0:                   openAPIV3Schema:
17:12:25.416 STDOUT terraform1.11.0:                     description: KuberoPostgresql is the Schema for the kuberopostgresqls API
17:12:25.416 STDOUT terraform1.11.0:                     properties:
17:12:25.416 STDOUT terraform1.11.0:                       apiVersion:
17:12:25.416 STDOUT terraform1.11.0:                         description: 'APIVersion defines the versioned schema of this representation
17:12:25.416 STDOUT terraform1.11.0:                           of an object. Servers should convert recognized schemas to the latest
17:12:25.416 STDOUT terraform1.11.0:                           internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
17:12:25.416 STDOUT terraform1.11.0:                         type: string
17:12:25.416 STDOUT terraform1.11.0:                       kind:
17:12:25.416 STDOUT terraform1.11.0:                         description: 'Kind is a string value representing the REST resource this
17:12:25.416 STDOUT terraform1.11.0:                           object represents. Servers may infer this from the endpoint the client
17:12:25.416 STDOUT terraform1.11.0:                           submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
17:12:25.416 STDOUT terraform1.11.0:                         type: string
17:12:25.416 STDOUT terraform1.11.0:                       metadata:
17:12:25.416 STDOUT terraform1.11.0:                         type: object
17:12:25.416 STDOUT terraform1.11.0:                       spec:
17:12:25.417 STDOUT terraform1.11.0:                         description: Spec defines the desired state of KuberoPostgresql
17:12:25.417 STDOUT terraform1.11.0:                         type: object
17:12:25.417 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.417 STDOUT terraform1.11.0:                       status:
17:12:25.417 STDOUT terraform1.11.0:                         description: Status defines the observed state of KuberoPostgresql
17:12:25.417 STDOUT terraform1.11.0:                         type: object
17:12:25.417 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.417 STDOUT terraform1.11.0:                     type: object
17:12:25.417 STDOUT terraform1.11.0:                 served: true
17:12:25.417 STDOUT terraform1.11.0:                 storage: true
17:12:25.417 STDOUT terraform1.11.0:                 subresources:
17:12:25.417 STDOUT terraform1.11.0:                   status: {}
17:12:25.417 STDOUT terraform1.11.0:         EOT
17:12:25.417 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.417 STDOUT terraform1.11.0:     }
17:12:25.417 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[18] will be created
17:12:25.417 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.417 STDOUT terraform1.11.0:       + api_version             = "apiextensions.k8s.io/v1"
17:12:25.417 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.417 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.417 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.417 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.417 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.418 STDOUT terraform1.11.0:       + kind                    = "CustomResourceDefinition"
17:12:25.418 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.418 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.418 STDOUT terraform1.11.0:       + name                    = "kuberoprometheuses.application.kubero.dev"
17:12:25.418 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.418 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.418 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.418 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.418 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.418 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.418 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.418 STDOUT terraform1.11.0:             apiVersion: apiextensions.k8s.io/v1
17:12:25.418 STDOUT terraform1.11.0:             kind: CustomResourceDefinition
17:12:25.418 STDOUT terraform1.11.0:             metadata:
17:12:25.418 STDOUT terraform1.11.0:               name: kuberoprometheuses.application.kubero.dev
17:12:25.418 STDOUT terraform1.11.0:             spec:
17:12:25.418 STDOUT terraform1.11.0:               group: application.kubero.dev
17:12:25.418 STDOUT terraform1.11.0:               names:
17:12:25.418 STDOUT terraform1.11.0:                 kind: KuberoPrometheus
17:12:25.418 STDOUT terraform1.11.0:                 listKind: KuberoPrometheusList
17:12:25.418 STDOUT terraform1.11.0:                 plural: kuberoprometheuses
17:12:25.418 STDOUT terraform1.11.0:                 singular: kuberoprometheus
17:12:25.418 STDOUT terraform1.11.0:               scope: Namespaced
17:12:25.418 STDOUT terraform1.11.0:               versions:
17:12:25.418 STDOUT terraform1.11.0:               - name: v1alpha1
17:12:25.418 STDOUT terraform1.11.0:                 schema:
17:12:25.418 STDOUT terraform1.11.0:                   openAPIV3Schema:
17:12:25.418 STDOUT terraform1.11.0:                     description: KuberoPrometheus is the Schema for the kuberoprometheuses API
17:12:25.418 STDOUT terraform1.11.0:                     properties:
17:12:25.418 STDOUT terraform1.11.0:                       apiVersion:
17:12:25.418 STDOUT terraform1.11.0:                         description: 'APIVersion defines the versioned schema of this representation
17:12:25.418 STDOUT terraform1.11.0:                           of an object. Servers should convert recognized schemas to the latest
17:12:25.419 STDOUT terraform1.11.0:                           internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
17:12:25.419 STDOUT terraform1.11.0:                         type: string
17:12:25.419 STDOUT terraform1.11.0:                       kind:
17:12:25.419 STDOUT terraform1.11.0:                         description: 'Kind is a string value representing the REST resource this
17:12:25.419 STDOUT terraform1.11.0:                           object represents. Servers may infer this from the endpoint the client
17:12:25.419 STDOUT terraform1.11.0:                           submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
17:12:25.419 STDOUT terraform1.11.0:                         type: string
17:12:25.419 STDOUT terraform1.11.0:                       metadata:
17:12:25.419 STDOUT terraform1.11.0:                         type: object
17:12:25.419 STDOUT terraform1.11.0:                       spec:
17:12:25.419 STDOUT terraform1.11.0:                         description: Spec defines the desired state of KuberoPrometheus
17:12:25.419 STDOUT terraform1.11.0:                         type: object
17:12:25.419 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.419 STDOUT terraform1.11.0:                       status:
17:12:25.419 STDOUT terraform1.11.0:                         description: Status defines the observed state of KuberoPrometheus
17:12:25.419 STDOUT terraform1.11.0:                         type: object
17:12:25.419 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.419 STDOUT terraform1.11.0:                     type: object
17:12:25.419 STDOUT terraform1.11.0:                 served: true
17:12:25.419 STDOUT terraform1.11.0:                 storage: true
17:12:25.419 STDOUT terraform1.11.0:                 subresources:
17:12:25.419 STDOUT terraform1.11.0:                   status: {}
17:12:25.419 STDOUT terraform1.11.0:         EOT
17:12:25.419 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.419 STDOUT terraform1.11.0:     }
17:12:25.419 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[19] will be created
17:12:25.419 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.419 STDOUT terraform1.11.0:       + api_version             = "apiextensions.k8s.io/v1"
17:12:25.419 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.419 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.419 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.419 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.420 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.420 STDOUT terraform1.11.0:       + kind                    = "CustomResourceDefinition"
17:12:25.420 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.420 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.420 STDOUT terraform1.11.0:       + name                    = "kuberorabbitmqs.application.kubero.dev"
17:12:25.420 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.420 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.420 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.420 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.420 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.420 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.420 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.420 STDOUT terraform1.11.0:             apiVersion: apiextensions.k8s.io/v1
17:12:25.420 STDOUT terraform1.11.0:             kind: CustomResourceDefinition
17:12:25.420 STDOUT terraform1.11.0:             metadata:
17:12:25.420 STDOUT terraform1.11.0:               name: kuberorabbitmqs.application.kubero.dev
17:12:25.420 STDOUT terraform1.11.0:             spec:
17:12:25.420 STDOUT terraform1.11.0:               group: application.kubero.dev
17:12:25.420 STDOUT terraform1.11.0:               names:
17:12:25.420 STDOUT terraform1.11.0:                 kind: KuberoRabbitMQ
17:12:25.420 STDOUT terraform1.11.0:                 listKind: KuberoRabbitMQList
17:12:25.420 STDOUT terraform1.11.0:                 plural: kuberorabbitmqs
17:12:25.420 STDOUT terraform1.11.0:                 singular: kuberorabbitmq
17:12:25.420 STDOUT terraform1.11.0:               scope: Namespaced
17:12:25.420 STDOUT terraform1.11.0:               versions:
17:12:25.420 STDOUT terraform1.11.0:               - name: v1alpha1
17:12:25.420 STDOUT terraform1.11.0:                 schema:
17:12:25.420 STDOUT terraform1.11.0:                   openAPIV3Schema:
17:12:25.420 STDOUT terraform1.11.0:                     description: KuberoRabbitMQ is the Schema for the kuberorabbitmqs API
17:12:25.421 STDOUT terraform1.11.0:                     properties:
17:12:25.421 STDOUT terraform1.11.0:                       apiVersion:
17:12:25.421 STDOUT terraform1.11.0:                         description: 'APIVersion defines the versioned schema of this representation
17:12:25.421 STDOUT terraform1.11.0:                           of an object. Servers should convert recognized schemas to the latest
17:12:25.421 STDOUT terraform1.11.0:                           internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
17:12:25.421 STDOUT terraform1.11.0:                         type: string
17:12:25.421 STDOUT terraform1.11.0:                       kind:
17:12:25.421 STDOUT terraform1.11.0:                         description: 'Kind is a string value representing the REST resource this
17:12:25.421 STDOUT terraform1.11.0:                           object represents. Servers may infer this from the endpoint the client
17:12:25.421 STDOUT terraform1.11.0:                           submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
17:12:25.421 STDOUT terraform1.11.0:                         type: string
17:12:25.421 STDOUT terraform1.11.0:                       metadata:
17:12:25.421 STDOUT terraform1.11.0:                         type: object
17:12:25.421 STDOUT terraform1.11.0:                       spec:
17:12:25.421 STDOUT terraform1.11.0:                         description: Spec defines the desired state of KuberoRabbitMQ
17:12:25.421 STDOUT terraform1.11.0:                         type: object
17:12:25.421 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.421 STDOUT terraform1.11.0:                       status:
17:12:25.421 STDOUT terraform1.11.0:                         description: Status defines the observed state of KuberoRabbitMQ
17:12:25.421 STDOUT terraform1.11.0:                         type: object
17:12:25.421 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.421 STDOUT terraform1.11.0:                     type: object
17:12:25.421 STDOUT terraform1.11.0:                 served: true
17:12:25.421 STDOUT terraform1.11.0:                 storage: true
17:12:25.421 STDOUT terraform1.11.0:                 subresources:
17:12:25.421 STDOUT terraform1.11.0:                   status: {}
17:12:25.421 STDOUT terraform1.11.0:         EOT
17:12:25.421 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.421 STDOUT terraform1.11.0:     }
17:12:25.421 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[20] will be created
17:12:25.421 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.421 STDOUT terraform1.11.0:       + api_version             = "apiextensions.k8s.io/v1"
17:12:25.421 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.422 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.422 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.422 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.422 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.422 STDOUT terraform1.11.0:       + kind                    = "CustomResourceDefinition"
17:12:25.422 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.422 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.422 STDOUT terraform1.11.0:       + name                    = "kuberoredis.application.kubero.dev"
17:12:25.422 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.422 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.422 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.422 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.422 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.422 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.422 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.422 STDOUT terraform1.11.0:             apiVersion: apiextensions.k8s.io/v1
17:12:25.422 STDOUT terraform1.11.0:             kind: CustomResourceDefinition
17:12:25.422 STDOUT terraform1.11.0:             metadata:
17:12:25.422 STDOUT terraform1.11.0:               name: kuberoredis.application.kubero.dev
17:12:25.422 STDOUT terraform1.11.0:             spec:
17:12:25.422 STDOUT terraform1.11.0:               group: application.kubero.dev
17:12:25.422 STDOUT terraform1.11.0:               names:
17:12:25.422 STDOUT terraform1.11.0:                 kind: KuberoRedis
17:12:25.422 STDOUT terraform1.11.0:                 listKind: KuberoRedisList
17:12:25.422 STDOUT terraform1.11.0:                 plural: kuberoredis
17:12:25.422 STDOUT terraform1.11.0:                 singular: kuberoredis
17:12:25.422 STDOUT terraform1.11.0:               scope: Namespaced
17:12:25.422 STDOUT terraform1.11.0:               versions:
17:12:25.422 STDOUT terraform1.11.0:               - name: v1alpha1
17:12:25.422 STDOUT terraform1.11.0:                 schema:
17:12:25.422 STDOUT terraform1.11.0:                   openAPIV3Schema:
17:12:25.422 STDOUT terraform1.11.0:                     description: KuberoRedis is the Schema for the kuberoredis API
17:12:25.422 STDOUT terraform1.11.0:                     properties:
17:12:25.422 STDOUT terraform1.11.0:                       apiVersion:
17:12:25.422 STDOUT terraform1.11.0:                         description: 'APIVersion defines the versioned schema of this representation
17:12:25.422 STDOUT terraform1.11.0:                           of an object. Servers should convert recognized schemas to the latest
17:12:25.423 STDOUT terraform1.11.0:                           internal value, and may reject unrecognized values. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#resources'
17:12:25.423 STDOUT terraform1.11.0:                         type: string
17:12:25.423 STDOUT terraform1.11.0:                       kind:
17:12:25.423 STDOUT terraform1.11.0:                         description: 'Kind is a string value representing the REST resource this
17:12:25.423 STDOUT terraform1.11.0:                           object represents. Servers may infer this from the endpoint the client
17:12:25.423 STDOUT terraform1.11.0:                           submits requests to. Cannot be updated. In CamelCase. More info: https://git.k8s.io/community/contributors/devel/sig-architecture/api-conventions.md#types-kinds'
17:12:25.423 STDOUT terraform1.11.0:                         type: string
17:12:25.423 STDOUT terraform1.11.0:                       metadata:
17:12:25.423 STDOUT terraform1.11.0:                         type: object
17:12:25.423 STDOUT terraform1.11.0:                       spec:
17:12:25.423 STDOUT terraform1.11.0:                         description: Spec defines the desired state of KuberoRedis
17:12:25.423 STDOUT terraform1.11.0:                         type: object
17:12:25.423 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.423 STDOUT terraform1.11.0:                       status:
17:12:25.423 STDOUT terraform1.11.0:                         description: Status defines the observed state of KuberoRedis
17:12:25.423 STDOUT terraform1.11.0:                         type: object
17:12:25.423 STDOUT terraform1.11.0:                         x-kubernetes-preserve-unknown-fields: true
17:12:25.423 STDOUT terraform1.11.0:                     type: object
17:12:25.423 STDOUT terraform1.11.0:                 served: true
17:12:25.423 STDOUT terraform1.11.0:                 storage: true
17:12:25.423 STDOUT terraform1.11.0:                 subresources:
17:12:25.423 STDOUT terraform1.11.0:                   status: {}
17:12:25.423 STDOUT terraform1.11.0:         EOT
17:12:25.423 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.423 STDOUT terraform1.11.0:     }
17:12:25.423 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[21] will be created
17:12:25.423 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.423 STDOUT terraform1.11.0:       + api_version             = "v1"
17:12:25.423 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.423 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.424 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.424 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.424 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.424 STDOUT terraform1.11.0:       + kind                    = "ServiceAccount"
17:12:25.424 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.424 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.424 STDOUT terraform1.11.0:       + name                    = "kubero-operator-controller-manager"
17:12:25.424 STDOUT terraform1.11.0:       + namespace               = "kubero-operator-system"
17:12:25.424 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.424 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.424 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.424 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.424 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.424 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.424 STDOUT terraform1.11.0:             apiVersion: v1
17:12:25.424 STDOUT terraform1.11.0:             kind: ServiceAccount
17:12:25.424 STDOUT terraform1.11.0:             metadata:
17:12:25.424 STDOUT terraform1.11.0:               name: kubero-operator-controller-manager
17:12:25.424 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:12:25.424 STDOUT terraform1.11.0:         EOT
17:12:25.424 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.424 STDOUT terraform1.11.0:     }
17:12:25.424 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[22] will be created
17:12:25.424 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.424 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.424 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.424 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.424 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.424 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.425 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.425 STDOUT terraform1.11.0:       + kind                    = "Role"
17:12:25.425 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.425 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.425 STDOUT terraform1.11.0:       + name                    = "kubero-operator-leader-election-role"
17:12:25.425 STDOUT terraform1.11.0:       + namespace               = "kubero-operator-system"
17:12:25.425 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.425 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.425 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.425 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.425 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.425 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.425 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.425 STDOUT terraform1.11.0:             kind: Role
17:12:25.425 STDOUT terraform1.11.0:             metadata:
17:12:25.425 STDOUT terraform1.11.0:               name: kubero-operator-leader-election-role
17:12:25.425 STDOUT terraform1.11.0:               namespace: kubero-operator-system
17:12:25.425 STDOUT terraform1.11.0:             rules:
17:12:25.425 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.425 STDOUT terraform1.11.0:               - ""
17:12:25.425 STDOUT terraform1.11.0:               resources:
17:12:25.425 STDOUT terraform1.11.0:               - configmaps
17:12:25.425 STDOUT terraform1.11.0:               verbs:
17:12:25.425 STDOUT terraform1.11.0:               - get
17:12:25.425 STDOUT terraform1.11.0:               - list
17:12:25.425 STDOUT terraform1.11.0:               - watch
17:12:25.425 STDOUT terraform1.11.0:               - create
17:12:25.425 STDOUT terraform1.11.0:               - update
17:12:25.425 STDOUT terraform1.11.0:               - patch
17:12:25.425 STDOUT terraform1.11.0:               - delete
17:12:25.425 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.425 STDOUT terraform1.11.0:               - coordination.k8s.io
17:12:25.425 STDOUT terraform1.11.0:               resources:
17:12:25.425 STDOUT terraform1.11.0:               - leases
17:12:25.425 STDOUT terraform1.11.0:               verbs:
17:12:25.425 STDOUT terraform1.11.0:               - get
17:12:25.425 STDOUT terraform1.11.0:               - list
17:12:25.425 STDOUT terraform1.11.0:               - watch
17:12:25.425 STDOUT terraform1.11.0:               - create
17:12:25.425 STDOUT terraform1.11.0:               - update
17:12:25.425 STDOUT terraform1.11.0:               - patch
17:12:25.425 STDOUT terraform1.11.0:               - delete
17:12:25.425 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.425 STDOUT terraform1.11.0:               - ""
17:12:25.425 STDOUT terraform1.11.0:               resources:
17:12:25.425 STDOUT terraform1.11.0:               - events
17:12:25.425 STDOUT terraform1.11.0:               verbs:
17:12:25.425 STDOUT terraform1.11.0:               - create
17:12:25.426 STDOUT terraform1.11.0:               - patch
17:12:25.426 STDOUT terraform1.11.0:         EOT
17:12:25.426 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.426 STDOUT terraform1.11.0:     }
17:12:25.426 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[23] will be created
17:12:25.426 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.426 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.426 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.426 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.426 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.426 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.426 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.426 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.426 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.426 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.426 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmemcached-admin-role"
17:12:25.426 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.426 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.426 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.426 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.426 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.426 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.426 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.426 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.426 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.426 STDOUT terraform1.11.0:             metadata:
17:12:25.426 STDOUT terraform1.11.0:               labels:
17:12:25.426 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.426 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.426 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmemcached-admin-role
17:12:25.427 STDOUT terraform1.11.0:             rules:
17:12:25.427 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.427 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.427 STDOUT terraform1.11.0:               resources:
17:12:25.427 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds
17:12:25.427 STDOUT terraform1.11.0:               verbs:
17:12:25.427 STDOUT terraform1.11.0:               - '*'
17:12:25.427 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.427 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.427 STDOUT terraform1.11.0:               resources:
17:12:25.427 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds/status
17:12:25.427 STDOUT terraform1.11.0:               verbs:
17:12:25.427 STDOUT terraform1.11.0:               - get
17:12:25.427 STDOUT terraform1.11.0:         EOT
17:12:25.427 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.427 STDOUT terraform1.11.0:     }
17:12:25.427 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[24] will be created
17:12:25.427 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.427 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.427 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.427 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.427 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.427 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.427 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.427 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.427 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.427 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.427 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmemcached-editor-role"
17:12:25.427 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.427 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.427 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.428 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.428 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.428 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.428 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.428 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.428 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.428 STDOUT terraform1.11.0:             metadata:
17:12:25.428 STDOUT terraform1.11.0:               labels:
17:12:25.428 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.428 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.428 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmemcached-editor-role
17:12:25.428 STDOUT terraform1.11.0:             rules:
17:12:25.428 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.428 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.428 STDOUT terraform1.11.0:               resources:
17:12:25.428 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds
17:12:25.428 STDOUT terraform1.11.0:               verbs:
17:12:25.428 STDOUT terraform1.11.0:               - create
17:12:25.428 STDOUT terraform1.11.0:               - delete
17:12:25.428 STDOUT terraform1.11.0:               - get
17:12:25.428 STDOUT terraform1.11.0:               - list
17:12:25.428 STDOUT terraform1.11.0:               - patch
17:12:25.428 STDOUT terraform1.11.0:               - update
17:12:25.428 STDOUT terraform1.11.0:               - watch
17:12:25.428 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.428 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.428 STDOUT terraform1.11.0:               resources:
17:12:25.428 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds/status
17:12:25.428 STDOUT terraform1.11.0:               verbs:
17:12:25.428 STDOUT terraform1.11.0:               - get
17:12:25.428 STDOUT terraform1.11.0:         EOT
17:12:25.428 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.428 STDOUT terraform1.11.0:     }
17:12:25.428 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[25] will be created
17:12:25.428 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.428 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.428 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.428 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.428 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.428 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.428 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.429 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.429 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.429 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.429 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmemcached-viewer-role"
17:12:25.429 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.429 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.429 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.429 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.429 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.429 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.429 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.429 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.429 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.429 STDOUT terraform1.11.0:             metadata:
17:12:25.429 STDOUT terraform1.11.0:               labels:
17:12:25.429 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.429 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.429 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmemcached-viewer-role
17:12:25.429 STDOUT terraform1.11.0:             rules:
17:12:25.429 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.429 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.429 STDOUT terraform1.11.0:               resources:
17:12:25.429 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds
17:12:25.429 STDOUT terraform1.11.0:               verbs:
17:12:25.429 STDOUT terraform1.11.0:               - get
17:12:25.429 STDOUT terraform1.11.0:               - list
17:12:25.429 STDOUT terraform1.11.0:               - watch
17:12:25.429 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.429 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.429 STDOUT terraform1.11.0:               resources:
17:12:25.429 STDOUT terraform1.11.0:               - kuberoaddonmemcacheds/status
17:12:25.429 STDOUT terraform1.11.0:               verbs:
17:12:25.429 STDOUT terraform1.11.0:               - get
17:12:25.429 STDOUT terraform1.11.0:         EOT
17:12:25.429 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.429 STDOUT terraform1.11.0:     }
17:12:25.429 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[26] will be created
17:12:25.430 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.430 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.430 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.430 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.430 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.430 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.430 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.430 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.430 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.430 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.430 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmongodb-admin-role"
17:12:25.430 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.430 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.430 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.430 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.430 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.430 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.430 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.430 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.430 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.430 STDOUT terraform1.11.0:             metadata:
17:12:25.430 STDOUT terraform1.11.0:               labels:
17:12:25.430 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.430 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.430 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmongodb-admin-role
17:12:25.430 STDOUT terraform1.11.0:             rules:
17:12:25.430 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.430 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.430 STDOUT terraform1.11.0:               resources:
17:12:25.430 STDOUT terraform1.11.0:               - kuberoaddonmongodbs
17:12:25.430 STDOUT terraform1.11.0:               verbs:
17:12:25.430 STDOUT terraform1.11.0:               - '*'
17:12:25.430 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.430 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.430 STDOUT terraform1.11.0:               resources:
17:12:25.430 STDOUT terraform1.11.0:               - kuberoaddonmongodbs/status
17:12:25.431 STDOUT terraform1.11.0:               verbs:
17:12:25.431 STDOUT terraform1.11.0:               - get
17:12:25.431 STDOUT terraform1.11.0:         EOT
17:12:25.431 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.431 STDOUT terraform1.11.0:     }
17:12:25.431 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[27] will be created
17:12:25.431 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.431 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.431 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.431 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.431 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.431 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.431 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.431 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.431 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.431 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.431 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmongodb-editor-role"
17:12:25.431 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.431 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.431 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.431 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.431 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.431 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.431 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.431 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.431 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.431 STDOUT terraform1.11.0:             metadata:
17:12:25.431 STDOUT terraform1.11.0:               labels:
17:12:25.431 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.431 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.432 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmongodb-editor-role
17:12:25.432 STDOUT terraform1.11.0:             rules:
17:12:25.432 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.432 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.432 STDOUT terraform1.11.0:               resources:
17:12:25.432 STDOUT terraform1.11.0:               - kuberoaddonmongodbs
17:12:25.432 STDOUT terraform1.11.0:               verbs:
17:12:25.432 STDOUT terraform1.11.0:               - create
17:12:25.432 STDOUT terraform1.11.0:               - delete
17:12:25.432 STDOUT terraform1.11.0:               - get
17:12:25.432 STDOUT terraform1.11.0:               - list
17:12:25.432 STDOUT terraform1.11.0:               - patch
17:12:25.432 STDOUT terraform1.11.0:               - update
17:12:25.432 STDOUT terraform1.11.0:               - watch
17:12:25.432 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.432 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.432 STDOUT terraform1.11.0:               resources:
17:12:25.432 STDOUT terraform1.11.0:               - kuberoaddonmongodbs/status
17:12:25.432 STDOUT terraform1.11.0:               verbs:
17:12:25.432 STDOUT terraform1.11.0:               - get
17:12:25.432 STDOUT terraform1.11.0:         EOT
17:12:25.432 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.432 STDOUT terraform1.11.0:     }
17:12:25.432 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[28] will be created
17:12:25.432 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.432 STDOUT terraform1.11.0:       +[
17:12:25.432 STDOUT terraform1.11.0: 0m api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.432 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.432 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.432 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.432 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.432 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.432 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.432 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.432 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.432 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmongodb-viewer-role"
17:12:25.432 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.433 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.433 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.433 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.433 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.433 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.433 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.433 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.433 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.433 STDOUT terraform1.11.0:             metadata:
17:12:25.433 STDOUT terraform1.11.0:               labels:
17:12:25.433 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.433 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.433 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmongodb-viewer-role
17:12:25.433 STDOUT terraform1.11.0:             rules:
17:12:25.433 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.433 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.433 STDOUT terraform1.11.0:               resources:
17:12:25.433 STDOUT terraform1.11.0:               - kuberoaddonmongodbs
17:12:25.433 STDOUT terraform1.11.0:               verbs:
17:12:25.433 STDOUT terraform1.11.0:               - get
17:12:25.433 STDOUT terraform1.11.0:               - list
17:12:25.433 STDOUT terraform1.11.0:               - watch
17:12:25.433 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.433 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.433 STDOUT terraform1.11.0:               resources:
17:12:25.433 STDOUT terraform1.11.0:               - kuberoaddonmongodbs/status
17:12:25.433 STDOUT terraform1.11.0:               verbs:
17:12:25.433 STDOUT terraform1.11.0:               - get
17:12:25.433 STDOUT terraform1.11.0:         EOT
17:12:25.433 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.433 STDOUT terraform1.11.0:     }
17:12:25.433 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[29] will be created
17:12:25.433 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.433 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.433 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.433 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.433 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.433 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.433 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.433 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.434 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.434 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.434 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmysql-admin-role"
17:12:25.434 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.434 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.434 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.434 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.434 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.434 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.434 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.434 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.434 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.434 STDOUT terraform1.11.0:             metadata:
17:12:25.434 STDOUT terraform1.11.0:               labels:
17:12:25.434 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.434 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.434 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmysql-admin-role
17:12:25.434 STDOUT terraform1.11.0:             rules:
17:12:25.434 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.435 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.435 STDOUT terraform1.11.0:               resources:
17:12:25.435 STDOUT terraform1.11.0:               - kuberoaddonmysqls
17:12:25.435 STDOUT terraform1.11.0:               verbs:
17:12:25.435 STDOUT terraform1.11.0:               - '*'
17:12:25.435 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.435 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.435 STDOUT terraform1.11.0:               resources:
17:12:25.435 STDOUT terraform1.11.0:               - kuberoaddonmysqls/status
17:12:25.435 STDOUT terraform1.11.0:               verbs:
17:12:25.435 STDOUT terraform1.11.0:               - get
17:12:25.435 STDOUT terraform1.11.0:         EOT
17:12:25.435 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.435 STDOUT terraform1.11.0:     }
17:12:25.435 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[30] will be created
17:12:25.435 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.435 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.435 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.435 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.435 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.435 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.435 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.435 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.435 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.435 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.435 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmysql-editor-role"
17:12:25.435 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.435 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.435 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.435 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.435 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.435 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.436 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.436 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.436 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.436 STDOUT terraform1.11.0:             metadata:
17:12:25.436 STDOUT terraform1.11.0:               labels:
17:12:25.436 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.436 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.436 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmysql-editor-role
17:12:25.436 STDOUT terraform1.11.0:             rules:
17:12:25.436 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.436 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.436 STDOUT terraform1.11.0:               resources:
17:12:25.436 STDOUT terraform1.11.0:               - kuberoaddonmysqls
17:12:25.436 STDOUT terraform1.11.0:               verbs:
17:12:25.436 STDOUT terraform1.11.0:               - create
17:12:25.436 STDOUT terraform1.11.0:               - delete
17:12:25.436 STDOUT terraform1.11.0:               - get
17:12:25.436 STDOUT terraform1.11.0:               - list
17:12:25.436 STDOUT terraform1.11.0:               - patch
17:12:25.436 STDOUT terraform1.11.0:               - update
17:12:25.436 STDOUT terraform1.11.0:               - watch
17:12:25.436 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.436 STDOUT terraform1.11.0:               - application.kubero.dev
17:12:25.436 STDOUT terraform1.11.0:               resources:
17:12:25.436 STDOUT terraform1.11.0:               - kuberoaddonmysqls/status
17:12:25.436 STDOUT terraform1.11.0:               verbs:
17:12:25.436 STDOUT terraform1.11.0:               - get
17:12:25.436 STDOUT terraform1.11.0:         EOT
17:12:25.436 STDOUT terraform1.11.0:       + yaml_incluster          = (sensitive value)
17:12:25.436 STDOUT terraform1.11.0:     }
17:12:25.436 STDOUT terraform1.11.0:   # kubectl_manifest.kubero_operator[31] will be created
17:12:25.436 STDOUT terraform1.11.0:   + resource "kubectl_manifest" "kubero_operator" {
17:12:25.436 STDOUT terraform1.11.0:       + api_version             = "rbac.authorization.k8s.io/v1"
17:12:25.436 STDOUT terraform1.11.0:       + apply_only              = false
17:12:25.436 STDOUT terraform1.11.0:       + field_manager           = "kubectl"
17:12:25.436 STDOUT terraform1.11.0:       + force_conflicts         = true
17:12:25.436 STDOUT terraform1.11.0:       + force_new               = false
17:12:25.436 STDOUT terraform1.11.0:       + id                      = (known after apply)
17:12:25.436 STDOUT terraform1.11.0:       + kind                    = "ClusterRole"
17:12:25.436 STDOUT terraform1.11.0:       + live_manifest_incluster = (sensitive value)
17:12:25.436 STDOUT terraform1.11.0:       + live_uid                = (known after apply)
17:12:25.436 STDOUT terraform1.11.0:       + name                    = "kubero-operator-kuberoaddonmysql-viewer-role"
17:12:25.437 STDOUT terraform1.11.0:       + namespace               = (known after apply)
17:12:25.437 STDOUT terraform1.11.0:       + server_side_apply       = true
17:12:25.437 STDOUT terraform1.11.0:       + uid                     = (known after apply)
17:12:25.437 STDOUT terraform1.11.0:       + validate_schema         = true
17:12:25.437 STDOUT terraform1.11.0:       + wait_for_rollout        = false
17:12:25.437 STDOUT terraform1.11.0:       + yaml_body               = (sensitive value)
17:12:25.437 STDOUT terraform1.11.0:       + yaml_body_parsed        = <<-EOT
17:12:25.437 STDOUT terraform1.11.0:             apiVersion: rbac.authorization.k8s.io/v1
17:12:25.437 STDOUT terraform1.11.0:             kind: ClusterRole
17:12:25.437 STDOUT terraform1.11.0:             metadata:
17:12:25.437 STDOUT terraform1.11.0:               labels:
17:12:25.437 STDOUT terraform1.11.0:                 app.kubernetes.io/managed-by: kustomize
17:12:25.437 STDOUT terraform1.11.0:                 app.kubernetes.io/name: kubero-operator
17:12:25.437 STDOUT terraform1.11.0:               name: kubero-operator-kuberoaddonmysql-viewer-role
17:12:25.437 STDOUT terraform1.11.0:             rules:
17:12:25.437 STDOUT terraform1.11.0:             - apiGroups:
17:12:25.437 STDOUT te
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.